app/controllers/api/v1/admin/books_controller.rb

        def get_books
          render json: { books: Book.all }
---
SELECT `books`.* FROM `books`