app/controllers/api/v1/admin/books_controller.rb

        def get_all_books
          render json: { books: Book.all }
---
SELECT `books`.* FROM `books`

        def get_book
          required(params, :id)
          resp = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

        def find_books
          resp = Book.find_books(params)
---
SELECT `books`.* FROM `books` WHERE (1)